Plan: running this to get a sense of what gets created in cloudflare
```
OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # cloudflare_record.gpo_ca will be created
  + resource "cloudflare_record" "gpo_ca" {
      + allow_overwrite = false
      + content         = "24.199.64.246"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = (known after apply)
    }

  # cloudflare_record.secure_gpo_ca will be created
  + resource "cloudflare_record" "secure_gpo_ca" {
      + allow_overwrite = false
      + content         = "192.124.249.179"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "secure.gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = (known after apply)
    }

  # cloudflare_record.txt_gpo_ca will be created
  + resource "cloudflare_record" "txt_gpo_ca" {
      + allow_overwrite = false
      + content         = "v=spf1 ip4:168.245.17.225 include:_spf.google.com include:helpscoutemail.com ~all"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "gpo.ca"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = (known after apply)
    }

  # cloudflare_zone.gpo_ca will be created
  + resource "cloudflare_zone" "gpo_ca" {
      + account_id          = (sensitive value)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + name_servers        = (known after apply)
      + paused              = false
      + plan                = (known after apply)
      + status              = (known after apply)
      + type                = "full"
      + vanity_name_servers = (known after apply)
      + verification_key    = (known after apply)
      + zone                = "gpo.ca"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```